spec/cassettes/stripe_create_payment_intent_succeeded.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/payment_intents
    body:
      encoding: UTF-8
      string: amount=500&currency=usd&customer=cus_RCJC8RKqcIdMHf&description=This+is+is+test+mode+payment+intent.&confirm=true&automatic_payment_methods[enabled]=true&automatic_payment_methods[allow_redirects]=never&shipping[address][city]=San+Francisco&shipping[address][country]=US&shipping[address][line1]=510+Townsend+St&shipping[address][postal_code]=94103&shipping[address][state]=CA&shipping[name]=Jenny+Rosen&payment_method=pm_card_visa
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/13.1.1
      Authorization:
      - "<BEARER_TOKEN>"
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_U4478bdPa15Jlr","request_duration_ms":12}}'
      Idempotency-Key:
      - "<IDEMPOTENCY_KEY>"
      Stripe-Version:
      - 2024-10-28.acacia
      X-Stripe-Client-User-Agent:
      - "<X_STRIPE_CLIENT_USER_AGENT>"
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 11 Nov 2024 10:27:39 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1749'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, HEAD, PUT, PATCH, POST, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - report-uri https://q.stripe.com/csp-report?p=v1%2Fpayment_intents; block-all-mixed-content;
        default-src 'none'; base-uri 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'
      Cross-Origin-Opener-Policy-Report-Only:
      - same-origin; report-to="coop"
      Idempotency-Key:
      - "<IDEMPOTENCY_KEY>"
      Original-Request:
      - req_tm2QIoqB3FMcYQ
      Report-To:
      - '{"group":"coop","max_age":8640,"endpoints":[{"url":"https://q.stripe.com/coop-report"}],"include_subdomains":true}'
      Reporting-Endpoints:
      - coop="https://q.stripe.com/coop-report"
      Request-Id:
      - req_tm2QIoqB3FMcYQ
      Stripe-Should-Retry:
      - 'false'
      Stripe-Version:
      - 2024-10-28.acacia
      Vary:
      - Origin
      X-Content-Type-Options:
      - nosniff
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - A
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "id": "pi_3QJuqMElA4InVgv80GAyAw7R",
          "object": "payment_intent",
          "amount": 500,
          "amount_capturable": 0,
          "amount_details": {
            "tip": {}
          },
          "amount_received": 500,
          "application": null,
          "application_fee_amount": null,
          "automatic_payment_methods": {
            "allow_redirects": "never",
            "enabled": true
          },
          "canceled_at": null,
          "cancellation_reason": null,
          "capture_method": "automatic_async",
          "client_secret": "<CLIENT_SECRET>",
          "confirmation_method": "automatic",
          "created": 1731320858,
          "currency": "usd",
          "customer": "cus_RCJC8RKqcIdMHf",
          "description": "This is is test mode payment intent.",
          "invoice": null,
          "last_payment_error": null,
          "latest_charge": "ch_3QJuqMElA4InVgv8084lgo2X",
          "livemode": false,
          "metadata": {},
          "next_action": null,
          "on_behalf_of": null,
          "payment_method": "pm_1QJuqMElA4InVgv8aAbwKw57",
          "payment_method_configuration_details": null,
          "payment_method_options": {
            "card": {
              "installments": null,
              "mandate_options": null,
              "network": null,
              "request_three_d_secure": "automatic"
            }
          },
          "payment_method_types": [
            "card"
          ],
          "processing": null,
          "receipt_email": null,
          "review": null,
          "setup_future_usage": null,
          "shipping": {
            "address": {
              "city": "San Francisco",
              "country": "US",
              "line1": "510 Townsend St",
              "line2": null,
              "postal_code": "94103",
              "state": "CA"
            },
            "carrier": null,
            "name": "Jenny Rosen",
            "phone": null,
            "tracking_number": null
          },
          "source": null,
          "statement_descriptor": null,
          "statement_descriptor_suffix": null,
          "status": "succeeded",
          "transfer_data": null,
          "transfer_group": null
        }
  recorded_at: Mon, 11 Nov 2024 10:27:38 GMT
recorded_with: VCR 6.3.1
